&НаСервере
Процедура ОбновитьТабличнуюЧастьНаСервере()             
	Для Каждого СтрокаТаблЧасти Из Объект.ТаблицаТоваров Цикл
		Товар = СтрокаТаблЧасти.Товар;
		СтрокаТаблЧасти.Цена = Товар.Цена;
		СтрокаТаблЧасти.Сумма = СтрокаТаблЧасти.Цена * СтрокаТаблЧасти.Количество;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТоваровТоварПриИзменении(Элемент)
	ОбновитьТабличнуюЧастьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТоваровКоличествоПриИзменении(Элемент)
	ОбновитьТабличнуюЧастьНаСервере();
КонецПроцедуры
