
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.РасходнаяНакладная.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасходнаяНакладная.Дата,
	|	РасходнаяНакладная.Клиент,
	|	РасходнаяНакладная.Номер,
	|	РасходнаяНакладная.Склад,
	|	РасходнаяНакладная.ТаблицаТоваров.(
	|		НомерСтроки,
	|		Товар,
	|		Количество,
	|		Цена,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|ГДЕ
	|	РасходнаяНакладная.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТаблицаТоваровШапка = Макет.ПолучитьОбласть("ТаблицаТоваровШапка");
	ОбластьТаблицаТоваров = Макет.ПолучитьОбласть("ТаблицаТоваров");
	ОбластьИтоги = Макет.ПолучитьОбласть("Итоги");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьТаблицаТоваровШапка);
		ВыборкаТаблицаТоваров = Выборка.ТаблицаТоваров.Выбрать(); 
		ИтоговаяСумма = 0;
		Пока ВыборкаТаблицаТоваров.Следующий() Цикл
			ОбластьТаблицаТоваров.Параметры.Заполнить(ВыборкаТаблицаТоваров);
			ТабДок.Вывести(ОбластьТаблицаТоваров, ВыборкаТаблицаТоваров.Уровень());
			ИтоговаяСумма = ИтоговаяСумма + ВыборкаТаблицаТоваров.Сумма;
		КонецЦикла;
		
		ОбластьИтоги.Параметры.ИтогПоРасходу = ИтоговаяСумма;   
		ТабДок.Вывести(ОбластьИтоги);
		
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
