
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОстаткиТоваров Расход
	Движения.ОстаткиТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаТаблицаТоваров Из ТаблицаТоваров Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаТаблицаТоваров.Товар;
		Движение.Склад = Склад;
		Движение.Количество = ТекСтрокаТаблицаТоваров.Количество;
		Движение.Цена = ТекСтрокаТаблицаТоваров.Цена;
	КонецЦикла;

	// регистр ПродажиТоваров 
	Движения.ПродажиТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаТаблицаТоваров Из ТаблицаТоваров Цикл
		Движение = Движения.ПродажиТоваров.Добавить();
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаТаблицаТоваров.Товар;
		Движение.Склад = Склад;
		Движение.Количество = ТекСтрокаТаблицаТоваров.Количество;
		Движение.Цена = ТекСтрокаТаблицаТоваров.Цена;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
