
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.Перемещение.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Перемещение.Дата,
	|	Перемещение.Номер,
	|	Перемещение.ТаблицаПеремещений.(
	|		НомерСтроки,
	|		СкладОтгрузки,
	|		СкладНазначения,
	|		Товар,
	|		Количество
	|	)
	|ИЗ
	|	Документ.Перемещение КАК Перемещение
	|ГДЕ
	|	Перемещение.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТаблицаПеремещенийШапка = Макет.ПолучитьОбласть("ТаблицаПеремещенийШапка");
	ОбластьТаблицаПеремещений = Макет.ПолучитьОбласть("ТаблицаПеремещений");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьТаблицаПеремещенийШапка);
		ВыборкаТаблицаПеремещений = Выборка.ТаблицаПеремещений.Выбрать();
		Пока ВыборкаТаблицаПеремещений.Следующий() Цикл
			ОбластьТаблицаПеремещений.Параметры.Заполнить(ВыборкаТаблицаПеремещений);
			ТабДок.Вывести(ОбластьТаблицаПеремещений, ВыборкаТаблицаПеремещений.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
