
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ПриходнаяНакладная.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПриходнаяНакладная.Дата,
	|	ПриходнаяНакладная.Номер,
	|	ПриходнаяНакладная.Поставщик,
	|	ПриходнаяНакладная.Склад,
	|	ПриходнаяНакладная.ТаблицаТоваров.(
	|		НомерСтроки,
	|		Товар,
	|		Количество,
	|		Цена,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
	|ГДЕ
	|	ПриходнаяНакладная.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТаблицаТоваровШапка = Макет.ПолучитьОбласть("ТаблицаТоваровШапка");
	ОбластьТаблицаТоваров = Макет.ПолучитьОбласть("ТаблицаТоваров");      
	ОбластьИтоги = Макет.ПолучитьОбласть("Итоги");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьТаблицаТоваровШапка);
		ВыборкаТаблицаТоваров = Выборка.ТаблицаТоваров.Выбрать();

		ИтоговаяСумма = 0;		
		Пока ВыборкаТаблицаТоваров.Следующий() Цикл
			ОбластьТаблицаТоваров.Параметры.Заполнить(ВыборкаТаблицаТоваров);
			ТабДок.Вывести(ОбластьТаблицаТоваров, ВыборкаТаблицаТоваров.Уровень());
			ИтоговаяСумма = ИтоговаяСумма + ВыборкаТаблицаТоваров.Сумма;
		КонецЦикла;   
		
		ОбластьИтоги.Параметры.ИтогПоПриходу = ИтоговаяСумма;
		ТабДок.Вывести(ОбластьИтоги);
		
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
